OpenNuvoton/NUC200_220BSP/Library/StdDriver/src/clk.c
    /* Apply new Divider */
    CLK->CLKDIV = (CLK->CLKDIV & (~CLK_CLKDIV_HCLK_N_Msk)) | u32ClkDiv;

    /* Switch to new HCLK source */
    CLK->CLKSEL0 = (CLK->CLKSEL0 & (~CLK_CLKSEL0_HCLK_S_Msk)) | u32ClkSrc;

    /* Update System Core Clock */
    SystemCoreClockUpdate();

    /* Disable HIRC if HIRC is disabled before switching HCLK source */
    if(u32HIRCSTB == 0)
        CLK->PWRCON &= ~CLK_PWRCON_OSC22M_EN_Msk;
}

/**
  * @brief      This function set selected module clock source and module clock divider
  * @param[in]  u32ModuleIdx is module index.
  * @param[in]  u32ClkSrc is module clock source.
  * @param[in]  u32ClkDiv is module clock divider.
  * @return     None
  * @details    The register write-protection function should be disabled before using this function.
  *             Valid parameter combinations listed in following table:
  *
  * |Module index        |Clock source                          |Divider                 |
  * | :----------------  | :----------------------------------  | :--------------------- |
  * |\ref WDT_MODULE     |\ref CLK_CLKSEL1_WDT_S_LIRC           | x                      |
  * |\ref WDT_MODULE     |\ref CLK_CLKSEL1_WDT_S_HCLK_DIV2048   | x                      |
  * |\ref WDT_MODULE     |\ref CLK_CLKSEL1_WDT_S_LXT            | x                      |
  * |\ref ADC_MODULE     |\ref CLK_CLKSEL1_ADC_S_HXT            |\ref CLK_CLKDIV_ADC(x)  |
  * |\ref ADC_MODULE     |\ref CLK_CLKSEL1_ADC_S_PLL            |\ref CLK_CLKDIV_ADC(x)  |
  * |\ref ADC_MODULE     |\ref CLK_CLKSEL1_ADC_S_HCLK           |\ref CLK_CLKDIV_ADC(x)  |
  * |\ref ADC_MODULE     |\ref CLK_CLKSEL1_ADC_S_HIRC           |\ref CLK_CLKDIV_ADC(x)  |
  * |\ref SPI0_MODULE    |\ref CLK_CLKSEL1_SPI0_S_HCLK          | x                      |
  * |\ref SPI0_MODULE    |\ref CLK_CLKSEL1_SPI0_S_PLL           | x                      |
  * |\ref SPI1_MODULE    |\ref CLK_CLKSEL1_SPI1_S_HCLK          | x                      |
  * |\ref SPI1_MODULE    |\ref CLK_CLKSEL1_SPI1_S_PLL           | x                      |
  * |\ref SPI2_MODULE    |\ref CLK_CLKSEL1_SPI2_S_HCLK          | x                      |
  * |\ref SPI2_MODULE    |\ref CLK_CLKSEL1_SPI2_S_PLL           | x                      |
  * |\ref SPI3_MODULE    |\ref CLK_CLKSEL1_SPI3_S_HCLK          | x                      |
  * |\ref SPI3_MODULE    |\ref CLK_CLKSEL1_SPI3_S_PLL           | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_HXT           | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_LXT           | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_HCLK          | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_EXT_TRG       | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_LIRC          | x                      |
  * |\ref TMR0_MODULE    |\ref CLK_CLKSEL1_TMR0_S_HIRC          | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_HXT           | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_LXT           | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_HCLK          | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_EXT_TRG       | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_LIRC          | x                      |
  * |\ref TMR1_MODULE    |\ref CLK_CLKSEL1_TMR1_S_HIRC          | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_HXT           | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_LXT           | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_HCLK          | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_EXT_TRG       | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_LIRC          | x                      |
  * |\ref TMR2_MODULE    |\ref CLK_CLKSEL1_TMR2_S_HIRC          | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_HXT           | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_LXT           | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_HCLK          | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_EXT_TRG       | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_LIRC          | x                      |
  * |\ref TMR3_MODULE    |\ref CLK_CLKSEL1_TMR3_S_HIRC          | x                      |
  * |\ref UART0_MODULE   |\ref CLK_CLKSEL1_UART_S_HXT           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART0_MODULE   |\ref CLK_CLKSEL1_UART_S_PLL           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART0_MODULE   |\ref CLK_CLKSEL1_UART_S_HIRC          |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART1_MODULE   |\ref CLK_CLKSEL1_UART_S_HXT           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART1_MODULE   |\ref CLK_CLKSEL1_UART_S_PLL           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART1_MODULE   |\ref CLK_CLKSEL1_UART_S_HIRC          |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART2_MODULE   |\ref CLK_CLKSEL1_UART_S_HXT           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART2_MODULE   |\ref CLK_CLKSEL1_UART_S_PLL           |\ref CLK_CLKDIV_UART(x) |
  * |\ref UART2_MODULE   |\ref CLK_CLKSEL1_UART_S_HIRC          |\ref CLK_CLKDIV_UART(x) |
  * |\ref PWM01_MODULE   |\ref CLK_CLKSEL_PWM01_HXT             | x                      |
  * |\ref PWM01_MODULE   |\ref CLK_CLKSEL_PWM01_LXT             | x                      |
  * |\ref PWM01_MODULE   |\ref CLK_CLKSEL_PWM01_HCLK            | x                      |
  * |\ref PWM01_MODULE   |\ref CLK_CLKSEL_PWM01_HIRC            | x                      |
  * |\ref PWM01_MODULE   |\ref CLK_CLKSEL_PWM01_LIRC            | x                      |
  * |\ref PWM23_MODULE   |\ref CLK_CLKSEL_PWM23_HXT             | x                      |
  * |\ref PWM23_MODULE   |\ref CLK_CLKSEL_PWM23_LXT             | x                      |
  * |\ref PWM23_MODULE   |\ref CLK_CLKSEL_PWM23_HCLK            | x                      |
  * |\ref PWM23_MODULE   |\ref CLK_CLKSEL_PWM23_HIRC            | x                      |
  * |\ref PWM23_MODULE   |\ref CLK_CLKSEL_PWM23_LIRC            | x                      |
  * |\ref I2S_MODULE     |\ref CLK_CLKSEL2_I2S_S_HXT            | x                      |
  * |\ref I2S_MODULE     |\ref CLK_CLKSEL2_I2S_S_PLL            | x                      |
  * |\ref I2S_MODULE     |\ref CLK_CLKSEL2_I2S_S_HCLK           | x                      |
  * |\ref I2S_MODULE     |\ref CLK_CLKSEL2_I2S_S_HIRC           | x                      |
  * |\ref FDIV_MODULE    |\ref CLK_CLKSEL2_FRQDIV_S_HXT         | x                      |
  * |\ref FDIV_MODULE    |\ref CLK_CLKSEL2_FRQDIV_S_LXT         | x                      |
  * |\ref FDIV_MODULE    |\ref CLK_CLKSEL2_FRQDIV_S_HCLK        | x                      |
  * |\ref FDIV_MODULE    |\ref CLK_CLKSEL2_FRQDIV_S_HIRC        | x                      |
  * |\ref PWM45_MODULE   |\ref CLK_CLKSEL_PWM45_HXT             | x                      |
  * |\ref PWM45_MODULE   |\ref CLK_CLKSEL_PWM45_LXT             | x                      |
  * |\ref PWM45_MODULE   |\ref CLK_CLKSEL_PWM45_HCLK            | x                      |
  * |\ref PWM45_MODULE   |\ref CLK_CLKSEL_PWM45_HIRC            | x                      |
  * |\ref PWM45_MODULE   |\ref CLK_CLKSEL_PWM45_LIRC            | x                      |
  * |\ref PWM67_MODULE   |\ref CLK_CLKSEL_PWM67_HXT             | x                      |
  * |\ref PWM67_MODULE   |\ref CLK_CLKSEL_PWM67_LXT             | x                      |
  * |\ref PWM67_MODULE   |\ref CLK_CLKSEL_PWM67_HCLK            | x                      |
  * |\ref PWM67_MODULE   |\ref CLK_CLKSEL_PWM67_HIRC            | x                      |
  * |\ref PWM67_MODULE   |\ref CLK_CLKSEL_PWM67_LIRC            | x                      |
  * |\ref WWDT_MODULE    |\ref CLK_CLKSEL2_WWDT_S_HCLK_DIV2048  | x                      |
  * |\ref WWDT_MODULE    |\ref CLK_CLKSEL2_WWDT_S_LIRC          | x                      |
  * |\ref SC0_MODULE     |\ref CLK_CLKSEL3_SC0_S_HXT            |\ref CLK_CLKDIV1_SC0(x) |
  * |\ref SC0_MODULE     |\ref CLK_CLKSEL3_SC0_S_PLL            |\ref CLK_CLKDIV1_SC0(x) |
  * |\ref SC0_MODULE     |\ref CLK_CLKSEL3_SC0_S_HCLK           |\ref CLK_CLKDIV1_SC0(x) |
  * |\ref SC0_MODULE     |\ref CLK_CLKSEL3_SC0_S_HIRC           |\ref CLK_CLKDIV1_SC0(x) |
  * |\ref SC1_MODULE     |\ref CLK_CLKSEL3_SC1_S_HXT            |\ref CLK_CLKDIV1_SC1(x) |
  * |\ref SC1_MODULE     |\ref CLK_CLKSEL3_SC1_S_PLL            |\ref CLK_CLKDIV1_SC1(x) |
  * |\ref SC1_MODULE     |\ref CLK_CLKSEL3_SC1_S_HCLK           |\ref CLK_CLKDIV1_SC1(x) |
  * |\ref SC1_MODULE     |\ref CLK_CLKSEL3_SC1_S_HIRC           |\ref CLK_CLKDIV1_SC1(x) |
  * |\ref SC2_MODULE     |\ref CLK_CLKSEL3_SC2_S_HXT            |\ref CLK_CLKDIV1_SC2(x) |
  * |\ref SC2_MODULE     |\ref CLK_CLKSEL3_SC2_S_PLL            |\ref CLK_CLKDIV1_SC2(x) |
  * |\ref SC2_MODULE     |\ref CLK_CLKSEL3_SC2_S_HCLK           |\ref CLK_CLKDIV1_SC2(x) |
  * |\ref SC2_MODULE     |\ref CLK_CLKSEL3_SC2_S_HIRC           |\ref CLK_CLKDIV1_SC2(x) |
  * |\ref USBD_MODULE    | x                                    |\ref CLK_CLKDIV_USB(x)  |
  */

